{
  "name": "Quan Tran.",
  "heroTitle": "I build what you imagine — right in the browser.",
  "heroHeadline": "I’m a software developer focused on building accessible, user-centered web applications. Currently learning Express.js and passionate about crafting impactful digital experiences.",
  "aboutP1": "Hello! My name is Quan, and I'm a Computer Science graduate from Georgia State University with a strong passion for software development, data analytics, and cloud computing. As an aspiring Full-Stack Developer, I’m driven by the challenge of building scalable, impactful applications that solve real-world problems. I enjoy working across the stack, continuously learning new technologies, and striving to write clean, efficient code.",
  "aboutP2": "Beyond the screen, I believe in living a balanced and disciplined life. I dedicate time to weightlifting and staying active in the gym, which keeps me focused, energized, and mentally sharp. Music is another creative outlet for me—I play the piano to unwind, reflect, and stay inspired.",
  "aboutP3": "I'm actively exploring new opportunities to grow as a developer and contribute to teams building meaningful products. If you're looking for someone driven, collaborative, and always learning—let’s get in touch!",
  "university": "B.S. in Computer Science - Georgia State University (2018-2024)",
  "courseWork": [
    "Data Structure",
    "Algorithm",
    "Operating System",
    "Network",
    "Software Developer",
    "Software Engineer",
    "Mobile App Developer",
    "Web Development"
  ],
  "email": "qtrann1379@gmail.com",
  "gitHub": "https://github.com/Quan987",
  "linkedin": "https://www.linkedin.com/in/qtrann1379",
  "instagram": "https://www.instagram.com/tquan_13",
  "twitter": "https://x.com/qtrann1379",
  "skills": [
    "HTML",
    "CSS",
    "JavaScript",
    "TypeScript",
    "PHP",
    "Node.js",
    "Express.js",
    "React",
    "Redux Toolkit",
    "React Query",
    "Tailwind CSS",
    "SQL",
    "MYSQL",
    "NoSQL",
    "Firebase",
    "Dart",
    "Flutter",
    "Java",
    "Python",
    "Vite"
  ],
  "projects": [
    {
      "title": "Password Generator App",
      "description": "A secure web application that generates strong, unique passwords and features a personal vault for safely storing and managing them.",
      "stack": [
        "JavaScript",
        "PHP",
        "SQL"
      ],
      "image": "assets/images/logo.png",
      "link": "https://github.com/Quan987/password-generator"
    },
    {
      "title": "Food Delivery App",
      "description": "A Flutter-based cross-platform mobile app that lets users browse restaurants, place orders, and track deliveries in real-time, with Firebase integration for authentication and live data updates.",
      "stack": [
        "Dart",
        "Flutter",
        "Firebase"
      ],
      "image": "assets/images/logo.png",
      "link": "https://github.com/Quan987/restaurant-flutter-app"
    },
    {
      "title": "OS System Monitor Project",
      "description": "A Java-based system resource monitor that uses the OSHI library to provide real-time insights into CPU, memory, disk, and network usage by interfacing directly with system hardware and the OS.",
      "stack": [
        "Java",
        "JavaFX/Swing",
        "OSHI",
        "JFreeChart"
      ],
      "link": "https://github.com/Quan987/os_project"
    },
    {
      "title": "Real Estate Web",
      "description": "A real estate web platform that streamlines property search and engagement through advanced filtering and optimized database performance for reliable, efficient CRUD operations.",
      "stack": [
        "HTML/CSS",
        "JavaScript",
        "PHP",
        "MySQL"
      ],
      "image": "assets/images/logo.png",
      "link": "https://github.com/Quan987/real-estate-web"
    }
  ],
  "navItems": ["Home", "About", "Project", "Contact"]
}
